# RemoveFluidSetting Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceSettings..::..RemoveFluidSetting Method
FabricationServiceSettings Class See Also
---
Clears the fluid setting of the specified service if found.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public void RemoveFluidSetting(
	FabricationService service
)
```

Visual Basic
---
```text
Public Sub RemoveFluidSetting ( _
	service As FabricationService _
)
```

Visual C++
---
```text
public:
void RemoveFluidSetting(
	FabricationService^ service
)
```

# ### Parameters
service
    Type: Autodesk.Revit.DB..::..FabricationService The service to clear.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace